flashsim_result/sysbench/ctoc_noshadow/nontrx_delete_t60.out
2018. 12. 19. (수) 23:02:40 KST
[SYSBENCH] Running benchmark...
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 16

Doing OLTP test.
Running non-transactional test
Using Uniform distribution
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 15 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            0
        write:                           432950
        other:                           0
        total:                           432950
    transactions:                        432950 (7210.10 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 432950 (7210.10 per sec.)
    other operations:                    0      (0.00 per sec.)

Test execution summary:
    total time:                          60.0477s
    total number of events:              432950
    total time taken by event execution: 960.3118
    per-request statistics:
         min:                                  0.13ms
         avg:                                  2.22ms
         max:                                131.43ms
         approx.  95 percentile:              16.91ms

Threads fairness:
    events (avg/stddev):           27059.3750/44.27
    execution time (avg/stddev):   60.0195/0.00

2018. 12. 19. (수) 23:03:40 KST

--------------------------------------------------------

mutex_t : 0x1904ea8 q:0x1904ea0, size:2048
mutex_t : 0x1905478 q:0x1905470, size:1024
mutex_t : 0x19054d8 q:0x19054d0, size:1024
mutex_t : 0x1905538 q:0x1905530, size:1024
nohost: [dm_nohost_probe] PROBE STARTED
Initializing Connectal & DMA...
subprocess pid 11070 completed status=0 0
[initPortalHardwareOnce:270] fd 5 len 0
[checkSignature:167] read status from '/dev/connectal' was only 0 bytes long
checkSignature: driver 'zynqportal.c' signature mismatch 3431c6f01fcc1c478c8187d1e6992edc e059016ac411386d6e2597d43bc49e15
checkSignature: driver 'portalmem.c' signature mismatch 0ba7c77e370fade81cfa5a0e5abb92f0 eef0fb3bacb31283d694f7aef3d380b3
Main::allocating memory...
USE_ACP = FALSE
USE_ACP = FALSE
Main::allocating memory finished!
[dmaManagerOnce:44]
Requested FCLK[0]=200000000 actually 200000000
Requested Freq: 200.00, Actual Freq: 200.00, status=0
LOG: DEBUG DUMP: gearSend = -165561767, gearRec = -248904438, aurSend = 201858248, aurRec = -30633729, readSend=-1200845360, writeSend=830722676
nohost: [dm_nohost_probe] PROBE DONE!
nohost: [dm_nohost_open] open done!
!!! print info !!!
Async status: 1
use wirte buffer: 1
Wait same mapping request(FLYING): 0
use gc polling: 0
use eviction polling: 0
# of total block: 512
# of total page: 8388608
page per block: 16384
# of translation block: 2
# of translation page: 32768
# of data block: 508
# of data page: 8323072
# of total cache mapping entry: 4096
max # of ram reside cme: 1024
max # of clean translation cache table: 512
cache percentage: 25.000%
!!! print info !!!
BM_Init() End!
mutex_t : 0x1925378 q:0x1925370, size:1024
mutex_t : 0x192bef8 q:0x192bef0, size:1024
mutex_t : 0x192bf58 q:0x192bf50, size:1024
_nos:512
bad_block_checking...[ 99.998474 ]
badblock_cnt: 90
_RNOS:4096
bad block 294912 -> 67092480
bad block 737280 -> 67076096
bad block 770048 -> 67059712
bad block 802816 -> 67043328
bad block 835584 -> 67026944
bad block 1474560 -> 67010560
bad block 1490944 -> 66994176
bad block 1884160 -> 66977792
bad block 2359296 -> 66961408
bad block 4620288 -> 66945024
bad block 5783552 -> 66928640
bad block 5931008 -> 66912256
bad block 6520832 -> 66895872
bad block 6619136 -> 66879488
bad block 8896512 -> 66863104
bad block 9060352 -> 66846720
bad block 9191424 -> 66830336
bad block 11255808 -> 66813952
bad block 12763136 -> 66797568
bad block 13467648 -> 66781184
bad block 13533184 -> 66764800
checking done!
server waiting.....
connected!!!
tpage_GC()
tpage_GC()

WAF: 1.56
tpage_GC()
tpage_GC()
tpage_GC()
[...]

WAF: 1.61
tpage_GC()
tpage_GC()

WAF: 1.54
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.50
tpage_GC()
tpage_GC()

WAF: 1.48
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.47
tpage_GC()
tpage_GC()

WAF: 1.46
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.45
tpage_GC()
tpage_GC()

WAF: 1.45
tpage_GC()
tpage_GC()
tpage_GC()

WAF: 1.44
tpage_GC()
tpage_GC()

WAF: 1.44
tpage_GC()
^C


[cdf]read---
60	2	0.000002
70	1	0.000003
120	2135	0.001873
130	41650	0.038367
140	80963	0.109306
150	46804	0.150315
160	38830	0.184337
170	38870	0.218395
180	33556	0.247796
190	24690	0.269430
200	20968	0.287802
210	20273	0.305565
220	19343	0.322513
230	15640	0.336216
240	13241	0.347818
250	11715	0.358083
260	11868	0.368481
270	21921	0.387688
280	36790	0.419923
290	41468	0.456257
300	40984	0.492167
310	41815	0.528805
320	41086	0.564804
330	38332	0.598390
340	37443	0.631197
350	36995	0.663612
360	35994	0.695150
370	32928	0.724001
380	30890	0.751066
390	28999	0.776475
400	27270	0.800369
410	24211	0.821582
420	21955	0.840819
430	19719	0.858097
440	18027	0.873892
450	16115	0.888011
460	14219	0.900470
470	12820	0.911703
480	11231	0.921543
490	10239	0.930515
500	9014	0.938413
510	7931	0.945362
520	7072	0.951558
530	6049	0.956858
540	5449	0.961632
550	4785	0.965825
560	4343	0.969630
570	3802	0.972962
580	3445	0.975980
590	2932	0.978549
600	2735	0.980945
610	2330	0.982987
620	2074	0.984804
630	1840	0.986416
640	1689	0.987896
650	1418	0.989139
660	1298	0.990276
670	1103	0.991242
680	945	0.992070
690	867	0.992830
700	758	0.993494
710	661	0.994073
720	649	0.994642
730	491	0.995072
740	452	0.995468
750	426	0.995842
760	344	0.996143
770	326	0.996429
780	323	0.996712
790	258	0.996938
800	257	0.997163
810	199	0.997337
820	165	0.997482
830	160	0.997622
840	135	0.997740
850	119	0.997845
860	102	0.997934
870	87	0.998010
880	80	0.998080
890	74	0.998145
900	68	0.998205
910	50	0.998249
920	60	0.998301
930	52	0.998347
940	48	0.998389
950	33	0.998418
960	30	0.998444
970	33	0.998473
980	28	0.998497
990	20	0.998515
1000	22	0.998534
1010	19	0.998551
1020	19	0.998567
1030	20	0.998585
1040	22	0.998604
1050	13	0.998616
1060	6	0.998621
1070	12	0.998631
1080	12	0.998642
1090	8	0.998649
1100	3	0.998652
1110	15	0.998665
1120	8	0.998672
1130	5	0.998676
1140	10	0.998685
1150	8	0.998692
1160	8	0.998699
1170	7	0.998705
1180	8	0.998712
1190	6	0.998717
1200	7	0.998723
1210	6	0.998729
1220	5	0.998733
1230	5	0.998737
1240	2	0.998739
1250	9	0.998747
1260	4	0.998751
1270	4	0.998754
1280	4	0.998758
1290	2	0.998759
1300	6	0.998765
1310	4	0.998768
1320	2	0.998770
1330	3	0.998772
1340	2	0.998774
1350	1	0.998775
1360	5	0.998779
1380	1	0.998780
1400	1	0.998781
1410	2	0.998783
1430	2	0.998785
1440	1	0.998786
1450	1	0.998786
1460	1	0.998787
1480	1	0.998788
1500	1	0.998789
1520	3	0.998792
1530	1	0.998793
1580	2	0.998794
1590	2	0.998796
1600	3	0.998799
1610	1	0.998800
1620	3	0.998802
1640	1	0.998803
1670	1	0.998804
1680	1	0.998805
1720	1	0.998806
1730	1	0.998807
1740	5	0.998811
1750	1	0.998812
1770	3	0.998815
1780	2	0.998816
1790	2	0.998818
1830	2	0.998820
1850	1	0.998821
1880	1	0.998821
1900	1	0.998822
1920	1	0.998823
1930	2	0.998825
1940	4	0.998829
1950	2	0.998830
1970	4	0.998834
1990	1	0.998835
2020	1	0.998836
2130	3	0.998838
2140	1	0.998839
2150	2	0.998841
2160	1	0.998842
2170	2	0.998843
2180	2	0.998845
2200	1	0.998846
2210	5	0.998850
2220	1	0.998851
2240	3	0.998854
2250	1	0.998855
2260	2	0.998857
2270	2	0.998858
2280	4	0.998862
2290	2	0.998864
2310	2	0.998865
2320	2	0.998867
2350	4	0.998871
2360	3	0.998873
2370	1	0.998874
2390	2	0.998876
2400	4	0.998879
2410	1	0.998880
2420	3	0.998883
2430	1	0.998884
2450	2	0.998886
2460	1	0.998886
2470	1	0.998887
2480	4	0.998891
2490	2	0.998892
2500	3	0.998895
2510	1	0.998896
2520	4	0.998900
2530	4	0.998903
2540	4	0.998906
2550	1	0.998907
2560	3	0.998910
2570	3	0.998913
2580	5	0.998917
2590	3	0.998920
2600	2	0.998921
2610	2	0.998923
2620	4	0.998927
2630	5	0.998931
2640	3	0.998934
2650	1	0.998935
2660	3	0.998937
2670	2	0.998939
2680	1	0.998940
2700	1	0.998941
2720	3	0.998943
2730	2	0.998945
2740	1	0.998946
2750	2	0.998948
2770	2	0.998949
2780	1	0.998950
2790	2	0.998952
2800	3	0.998955
2810	1	0.998956
2820	1	0.998956
2830	3	0.998959
2840	2	0.998961
2850	6	0.998966
2860	1	0.998967
2870	4	0.998970
2880	2	0.998972
2890	1	0.998973
2900	2	0.998975
2910	5	0.998979
2920	1	0.998980
2940	1	0.998981
2970	1	0.998982
2990	5	0.998986
3000	1	0.998987
3010	1	0.998988
3020	2	0.998990
3030	1	0.998991
3040	3	0.998993
3050	1	0.998994
3060	2	0.998996
3070	1	0.998997
3080	2	0.998999
3160	1	0.998999
3170	1	0.999000
3180	1	0.999001
3200	5	0.999005
3210	2	0.999007
3220	1	0.999008
3230	3	0.999011
3240	1	0.999012
3250	1	0.999013
3260	2	0.999014
3270	3	0.999017
3290	1	0.999018
3300	4	0.999021
3320	1	0.999022
3330	5	0.999027
3340	1	0.999027
3350	3	0.999030
3360	4	0.999034
3380	4	0.999037
3390	4	0.999041
3400	2	0.999042
3410	4	0.999046
3420	2	0.999048
3430	3	0.999050
3440	2	0.999052
3450	2	0.999054
3460	1	0.999055
3470	2	0.999056
3480	5	0.999061
3490	1	0.999062
3500	2	0.999063
3510	2	0.999065
3520	4	0.999069
3530	1	0.999070
3540	1	0.999070
3550	2	0.999072
3560	3	0.999075
3570	1	0.999076
3580	1	0.999076
3590	1	0.999077
3600	1	0.999078
3640	3	0.999081
3650	1	0.999082
3670	2	0.999084
3680	3	0.999086
3690	1	0.999087
3710	1	0.999088
3720	2	0.999090
3780	2	0.999091
3820	1	0.999092
3830	1	0.999093
3860	1	0.999094
3870	3	0.999097
3880	4	0.999100
3890	4	0.999104
3900	10	0.999112
3910	7	0.999119
3920	7	0.999125
3930	5	0.999129
3940	4	0.999133
3950	4	0.999136
3960	5	0.999140
3970	2	0.999142
3980	5	0.999147
3990	3	0.999149
4000	1	0.999150
4020	1	0.999151
4030	2	0.999153
4040	7	0.999159
4050	5	0.999163
4060	9	0.999171
4070	1	0.999172
4080	1	0.999173
4090	3	0.999175
4100	2	0.999177
4110	4	0.999181
4120	3	0.999183
4130	1	0.999184
4140	2	0.999186
4150	3	0.999189
4170	2	0.999190
4180	1	0.999191
4190	2	0.999193
4200	3	0.999196
4210	3	0.999198
4220	2	0.999200
4230	2	0.999202
4240	1	0.999203
4250	2	0.999204
4260	5	0.999209
4270	3	0.999211
4290	4	0.999215
4310	2	0.999217
4320	7	0.999223
4330	4	0.999226
4340	2	0.999228
4350	7	0.999234
4360	3	0.999237
4370	3	0.999239
4380	6	0.999245
4390	8	0.999252
4400	8	0.999259
4410	1	0.999260
4420	1	0.999260
4430	3	0.999263
4440	6	0.999268
4450	5	0.999273
4460	3	0.999275
4470	3	0.999278
4480	2	0.999280
4490	1	0.999281
4500	2	0.999282
4510	3	0.999285
4520	2	0.999287
4530	1	0.999288
4540	4	0.999291
4550	3	0.999294
4560	1	0.999295
4570	3	0.999297
4580	3	0.999300
4590	2	0.999302
4600	2	0.999303
4610	5	0.999308
4620	1	0.999309
4630	1	0.999310
4640	4	0.999313
4650	1	0.999314
4660	3	0.999317
4670	4	0.999320
4680	10	0.999329
4690	1	0.999330
4700	1	0.999331
4710	1	0.999331
4730	3	0.999334
4750	1	0.999335
4760	4	0.999338
4770	1	0.999339
4780	3	0.999342
4790	1	0.999343
4800	1	0.999344
4820	1	0.999345
4830	2	0.999346
4850	1	0.999347
4870	3	0.999350
4880	1	0.999351
4890	4	0.999354
4900	7	0.999360
4910	8	0.999367
4920	1	0.999368
4930	4	0.999372
4960	3	0.999374
4970	2	0.999376
4980	2	0.999378
4990	4	0.999381
5000	5	0.999386
5020	2	0.999388
5030	3	0.999390
5040	1	0.999391
5050	2	0.999393
5060	1	0.999394
5070	2	0.999395
5080	2	0.999397
5090	1	0.999398
5100	4	0.999402
5110	3	0.999404
5120	2	0.999406
5130	2	0.999408
5140	1	0.999409
5150	1	0.999409
5160	3	0.999412
5170	5	0.999416
5180	1	0.999417
5190	1	0.999418
5200	1	0.999419
5240	3	0.999422
5260	2	0.999423
5280	1	0.999424
5290	2	0.999426
5300	1	0.999427
5310	1	0.999428
5410	1	0.999429
5710	2	0.999430
5960	1	0.999431
6080	2	0.999433
6120	2	0.999435
6160	2	0.999437
6180	2	0.999438
6200	2	0.999440
6250	1	0.999441
6270	1	0.999442
6280	2	0.999444
6290	3	0.999446
6310	3	0.999449
6320	1	0.999450
6330	3	0.999452
6340	4	0.999456
6350	2	0.999458
6360	1	0.999458
6370	3	0.999461
6380	3	0.999464
6390	5	0.999468
6400	4	0.999472
6410	6	0.999477
6420	3	0.999480
6430	7	0.999486
6440	2	0.999487
6450	1	0.999488
6460	2	0.999490
6470	7	0.999496
6480	2	0.999498
6490	5	0.999502
6500	3	0.999505
6510	4	0.999508
6520	5	0.999513
6530	2	0.999515
6540	1	0.999515
6550	4	0.999519
6560	2	0.999521
6580	1	0.999522
6590	4	0.999525
6600	3	0.999528
6610	3	0.999530
6620	1	0.999531
6630	2	0.999533
6650	3	0.999536
6660	5	0.999540
6680	3	0.999543
6690	3	0.999545
6700	1	0.999546
6710	5	0.999551
6720	4	0.999554
6730	1	0.999555
6740	4	0.999558
6750	1	0.999559
6760	3	0.999562
6770	1	0.999563
6790	3	0.999565
6800	1	0.999566
6810	6	0.999572
6830	1	0.999572
6840	1	0.999573
6860	1	0.999574
6870	2	0.999576
6900	1	0.999577
6920	3	0.999579
6940	2	0.999581
6950	4	0.999585
6960	2	0.999586
6970	1	0.999587
6980	4	0.999591
6990	1	0.999592
7000	3	0.999594
7010	2	0.999596
7020	2	0.999598
7030	5	0.999602
7040	4	0.999606
7050	1	0.999607
7060	1	0.999607
7070	2	0.999609
7080	3	0.999612
7090	3	0.999614
7100	3	0.999617
7120	2	0.999619
7130	3	0.999622
7140	3	0.999624
7150	2	0.999626
7160	3	0.999628
7170	4	0.999632
7180	5	0.999636
7190	5	0.999641
7200	3	0.999643
7210	1	0.999644
7220	2	0.999646
7230	7	0.999652
7240	4	0.999656
7250	3	0.999658
7260	4	0.999662
7270	9	0.999670
7280	5	0.999674
7290	4	0.999678
7300	3	0.999680
7310	7	0.999686
7320	4	0.999690
7330	2	0.999692
7340	1	0.999692
7350	2	0.999694
7360	3	0.999697
7370	2	0.999699
7380	1	0.999699
7400	4	0.999703
7410	2	0.999705
7440	1	0.999706
7450	1	0.999706
7460	1	0.999707
7470	5	0.999712
7480	2	0.999713
7490	2	0.999715
7500	1	0.999716
7510	2	0.999718
7520	4	0.999721
7530	2	0.999723
7540	2	0.999725
7550	1	0.999726
7560	1	0.999727
7580	3	0.999729
7590	1	0.999730
7610	1	0.999731
7650	1	0.999732
7680	2	0.999734
7690	2	0.999735
7700	2	0.999737
7710	1	0.999738
7730	1	0.999739
7740	2	0.999741
7760	1	0.999741
7780	2	0.999743
7800	1	0.999744
7820	4	0.999748
7830	3	0.999750
7860	8	0.999757
7870	2	0.999759
7880	3	0.999762
7890	2	0.999763
7900	2	0.999765
7910	5	0.999770
7920	3	0.999772
7930	5	0.999777
7940	4	0.999780
7950	1	0.999781
7960	1	0.999782
7970	6	0.999787
7980	2	0.999789
7990	1	0.999790
8000	1	0.999791
8010	2	0.999792
8070	2	0.999794
8080	1	0.999795
8090	1	0.999796
8100	1	0.999797
8110	5	0.999801
8120	1	0.999802
8130	1	0.999803
8160	2	0.999805
8170	1	0.999806
8190	2	0.999807
8200	2	0.999809
8280	3	0.999812
8350	1	0.999812
8390	3	0.999815
8400	1	0.999816
8410	1	0.999817
8420	2	0.999819
8430	1	0.999820
8450	1	0.999820
8460	1	0.999821
8470	4	0.999825
8480	1	0.999826
8490	3	0.999828
8500	2	0.999830
8510	2	0.999832
8530	1	0.999833
8540	2	0.999834
8550	2	0.999836
8590	2	0.999838
8600	1	0.999839
8610	2	0.999841
8620	2	0.999842
8640	1	0.999843
8650	6	0.999848
8660	3	0.999851
8670	5	0.999855
8680	4	0.999859
8690	1	0.999860
8700	2	0.999862
8710	2	0.999863
8810	2	0.999865
8830	1	0.999866
9850	1	0.999867
9870	1	0.999868
9880	2	0.999869
9890	2	0.999871
9900	4	0.999875
9920	1	0.999876
9930	1	0.999876
9940	5	0.999881
9960	1	0.999882
9970	1	0.999883
9980	2	0.999884
10010	1	0.999885
10020	2	0.999887
10030	1	0.999888
10040	1	0.999889
10050	1	0.999890
10070	1	0.999890
10080	3	0.999893
10090	1	0.999894
10120	1	0.999895
10130	1	0.999896
10140	1	0.999897
10160	4	0.999900
10170	1	0.999901
10200	1	0.999902
10220	1	0.999903
10260	1	0.999904
10320	1	0.999905
10380	1	0.999905
10400	2	0.999907
10410	2	0.999909
10420	1	0.999910
10610	2	0.999911
10620	1	0.999912
10640	1	0.999913
10680	1	0.999914
10750	1	0.999915
10760	1	0.999916
10930	1	0.999917
10940	2	0.999919
10960	2	0.999920
11450	1	0.999921
11520	1	0.999922
11540	1	0.999923
11570	1	0.999924
11580	1	0.999925
11590	2	0.999926
11660	1	0.999927
11670	1	0.999928
11690	1	0.999929
11720	1	0.999930
11730	1	0.999931
11750	4	0.999934
11780	3	0.999937
11790	1	0.999938
11800	1	0.999939
11810	6	0.999944
11820	4	0.999947
11830	2	0.999949
11840	4	0.999953
11850	3	0.999955
11860	1	0.999956
11870	1	0.999957
11880	2	0.999959
11910	1	0.999960
11920	1	0.999961
11930	1	0.999961
11940	2	0.999963
11980	2	0.999965
12000	1	0.999966
12010	3	0.999968
12020	1	0.999969
12080	2	0.999971
12090	2	0.999973
12100	1	0.999974
12110	2	0.999975
12120	5	0.999980
12190	1	0.999981
12220	1	0.999982
16260	1	0.999982
16370	1	0.999983
16630	1	0.999984
19490	2	0.999986
19550	2	0.999988
19560	1	0.999989
19580	2	0.999990
19620	1	0.999991
19630	1	0.999992
19640	1	0.999993
19670	2	0.999995
19680	1	0.999996
19690	2	0.999997
19700	2	0.999999
19720	1	1.000000
a_type	l_type	max	min	avg	cnt	percentage
0	0	60	0	3.933	60	0.00526%
1	0	11999	120	183.809	806951	70.70430%
2	0	904	270	365.533	512	0.04486%
3	0	19695	146	381.272	333840	29.25075%
--------------------------------------------
|            bench type:                   |
--------------------------------------------
----algorithm----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----lower----
[0~100(usec)]: 0
[100~200(usec)]: 0
[200~300(usec)]: 0
[300~400(usec)]: 0
[400~500(usec)]: 0
[500~600(usec)]: 0
[600~700(usec)]: 0
[700~800(usec)]: 0
[800~900(usec)]: 0
[900~1000(usec)]: 0
[over_ms]: 0
[over__s]: 0
----average----
[avg_algo]: 0.0
[avg_low]: 0.0
-----lower_info----
[write_op]: 0
[read_op]: 0
[trim_op]:0
[WAF, RAF]: 0.000000, 0.000000
[if rw test]: 0.000000(WAF), 0.000000(RAF)
[all write Time]:0.0
[all read Time]:0.0

----summary----
[all_time]: 0.0
[size]: 78125.359375(mb)
[FAIL NUM] 0
[SUCCESS RATIO] 1.000000
[throughput] inf(kb/s)
             inf(mb/s)
[cache hit cnt,ratio] 0, 0.000000
[cache hit cnt,ratio dftl] 0, 0.000000
[READ WRITE CNT] 1141304 8858683
error cnt:145
result of ms:
---
bye bye!
# of gc: 29
# of translation page gc: 29
# of data page gc: 0
# of translation page gc w/ data page gc: 0
# of translation page gc w/ read op: 0
# of evict: 832105
# of buf hit: 3
!!! print info !!!
BH: buffer hit, H: hit, R: read, MC: memcpy, CE: clean eviction, DE: dirty eviction, GC: garbage collection
a_type--->>> 0: BH, 1: H
2: R & MC, 3: R & CE & MC
4: R & DE & MC, 5: R & CE & GC & MC
6: R & DE & GC & MC
!!! print info !!!
Cache hit on read: 0
Cache miss on read: 0
Cache hit on write: 7387484
Cache miss on write: 437924

Clean hit on read: 660677
Dirty hit on read: 174176
Clean hit on write: 60853
Dirty hit on write: 7326631

% of miss : 0.08
# Clean eviction: 333840
# Dirty eviction: 498265

Clean eviciton on read: 333840
Dirty eviction on read: 0
Clean eviction on write: 0
Dirty eviction on write: 498265

Dirty eviction ratio: 59.88%
Dirty eviction ratio on read: 0.00%
Dirty eviction ratio on write: 100.00%

WAF: 1.44

0 29
1 1204192
2 498265
3 1964
4 1964
5 1141301
6 7825408
7 0
8 0
bdbm_mt max: 0
nohost: Wait for all the on-going jobs to finish...
nohost: [dm_nohost_close] MAP Download from HW!
nohost: [dm_nohost_close] closed!
write_q_hit:184076	read_q_hit:1	retry_hit:0